PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/io_pins/io_timer.c
}

static inline void io_timer_set_PWM_mode(unsigned timer)
{
	int channels = get_timer_channels(timer);

	irqstate_t flags = px4_enter_critical_section();

	for (uint32_t channel = 0; channel < DIRECT_PWM_OUTPUT_CHANNELS; ++channel) {
		if ((1 << channel) & channels) {
			uint16_t rvalue = rCTRL(channels_timer(channel), timer_io_channels[channel].sub_module);
			rvalue &= ~(SMCTRL_PRSC_MASK | SMCTRL_LDMOD);
			rvalue |= SMCTRL_PRSC_DIV16;
			rMCTRL(channels_timer(channel)) |= (timer_io_channels[channel].sub_module_bits >> MCTRL_LDOK_SHIFT) << MCTRL_CLDOK_SHIFT
							   ;
			rCTRL(channels_timer(channel), timer_io_channels[channel].sub_module)  = rvalue;
			rMCTRL(channels_timer(channel)) |= timer_io_channels[channel].sub_module_bits;
		}
	}

	px4_leave_critical_section(flags);
}

void io_timer_trigger(unsigned channel_mask)
{
	// Any Channels in oneshot?

	int oneshots = io_timer_get_mode_channels(IOTimerChanMode_OneShot) & channel_mask;

	// Yes do triggering
	if (oneshots) {
		struct {
			uint32_t base;
			uint16_t triggers;
		} action_cache[MAX_IO_TIMERS] = {0};

		int actions = 0;

		// Get the Timer modules addresses
		for (int timer = 0; timer < MAX_IO_TIMERS && io_timers[timer].base != 0; timer++) {
			if (action_cache[actions].base == 0) {
				action_cache[actions].base = io_timers[timer].base;

			} else if (action_cache[actions].base != io_timers[timer].base) {
				actions++;
				action_cache[actions].base = io_timers[timer].base;
			}
		}


		/* Pre-calculate the list of channels to Trigger for each Timer module */

		int mask;
		uint32_t channel = 0;

		for (actions = 0; actions < MAX_IO_TIMERS; actions++) {
			if (action_cache[actions].base == 0) {
				// All have been processed
				break;
			}

			// Group the bits from channels on the same timer
			for (; channel < MAX_TIMER_IO_CHANNELS && timer_io_channels[channel].val_offset;  channel++) {

				if (io_timers[timer_io_channels[channel].timer_index].base != action_cache[actions].base) {
					break;
				}

				mask = get_channel_mask(channel);

				if (oneshots & mask) {
					action_cache[actions].triggers |= timer_io_channels[channel].sub_module_bits;
				}
			}
		}

		/* Now do them all with the shortest delay in between */

		irqstate_t flags = px4_enter_critical_section();

		for (actions = 0; action_cache[actions].base != 0 &&  actions < MAX_IO_TIMERS; actions++) {
			_REG16(action_cache[actions].base, IMXRT_FLEXPWM_MCTRL_OFFSET) |= (action_cache[actions].triggers >> MCTRL_LDOK_SHIFT)
					<< MCTRL_CLDOK_SHIFT ;
			_REG16(action_cache[actions].base, IMXRT_FLEXPWM_MCTRL_OFFSET) |= action_cache[actions].triggers;
		}

		px4_leave_critical_section(flags);
	}
}

int io_timer_init_timer(unsigned timer, io_timer_channel_mode_t mode)
{
	if (validate_timer_index(timer) != 0) {
		return -EINVAL;
	}

	io_timer_channel_mode_t previous_mode = timer_allocations[timer];
	int rv = io_timer_allocate_timer(timer, mode);

	/* Do this only once per timer */
	if (rv == 0 && previous_mode == IOTimerChanMode_NotUsed) {

		irqstate_t flags = px4_enter_critical_section();

		/* enable the timer clock before we try to talk to it */

		switch (io_timers[timer].base) {
		case IMXRT_FLEXPWM1_BASE:
			imxrt_clockall_pwm1();
			break;

		case IMXRT_FLEXPWM2_BASE:
			imxrt_clockall_pwm2();
			break;

		case IMXRT_FLEXPWM3_BASE:
			imxrt_clockall_pwm3();
			break;

		case IMXRT_FLEXPWM4_BASE:
			imxrt_clockall_pwm4();
			break;
		}

		int channels = get_timer_channels(timer);

		for (uint32_t chan = 0; chan < DIRECT_PWM_OUTPUT_CHANNELS; ++chan) {
			if ((1 << chan) & channels) {

				/* Clear all Faults */
				rFSTS0(timer) = FSTS_FFLAG_MASK;

				rCTRL2(timer, timer_io_channels[chan].sub_module) = SMCTRL2_CLK_SEL_EXT_CLK | SMCTRL2_DBGEN | SMCTRL2_INDEP;
				rCTRL(timer, timer_io_channels[chan].sub_module)  = SMCTRL_PRSC_DIV16 | SMCTRL_FULL;
				/* Edge aligned at 0 */
				rINIT(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
				rVAL0(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
				rVAL2(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
				rVAL4(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
				rFFILT0(timer) &= ~FFILT_FILT_PER_MASK;
				rDISMAP0(timer, timer_io_channels[chan].sub_module) = 0xf000;
				rDISMAP1(timer, timer_io_channels[chan].sub_module) = 0xf000;
				rOUTEN(timer) |= timer_io_channels[chan].val_offset == PWMA_VAL ? OUTEN_PWMA_EN(1 << timer_io_channels[chan].sub_module)
						 : OUTEN_PWMB_EN(1 << timer_io_channels[chan].sub_module);
				rDTSRCSEL(timer) = 0;
				rMCTRL(timer) = MCTRL_LDOK(1 << timer_io_channels[chan].sub_module);
				rMCTRL(timer) = timer_io_channels[chan].sub_module_bits;
			}
		}

		io_timer_set_PWM_mode(timer);
		timer_set_rate(timer, 50);

		px4_leave_critical_section(flags);
	}

	return rv;
}


int io_timer_set_pwm_rate(unsigned timer, unsigned rate)
{
	/* Change only a timer that is owned by pwm or one shot */
	if (timer_allocations[timer] != IOTimerChanMode_PWMOut && timer_allocations[timer] != IOTimerChanMode_OneShot) {
		return -EINVAL;
	}

	/* Get the channel bits that belong to the timer and are in PWM or OneShot mode */

	uint32_t channels = get_channel_mask(timer) & (io_timer_get_mode_channels(IOTimerChanMode_OneShot) |
			    io_timer_get_mode_channels(IOTimerChanMode_PWMOut));

	/* Request to use OneShot ?*/

	if (PWM_RATE_ONESHOT == rate) {

		/* Request to use OneShot
		 */
		int changed_channels = reallocate_channel_resources(channels, IOTimerChanMode_PWMOut, IOTimerChanMode_OneShot);

		/* Did the allocation change */
		if (changed_channels) {
			io_timer_set_oneshot_mode(timer);
		}

	} else {

		/* Request to use PWM
		 */
		int changed_channels = reallocate_channel_resources(channels, IOTimerChanMode_OneShot, IOTimerChanMode_PWMOut);

		if (changed_channels) {
			io_timer_set_PWM_mode(timer);
		}

		timer_set_rate(timer, rate);
	}

	return OK;
}

int io_timer_channel_init(unsigned channel, io_timer_channel_mode_t mode,
			  channel_handler_t channel_handler, void *context)
{
	if (io_timer_validate_channel_index(channel) != 0) {
		return -EINVAL;
	}

	uint32_t gpio = 0;

	/* figure out the GPIO config first */

